seasons_list = ['Зима', 'Весна', 'Лето', 'Осень']
year_dict = {
                1: ("Январь", "Зима"),
                2: ("Февраль", "Зима"),
                3: ("Март", "Весна"),
                4: ("Апрель", "Весна"),
                5: ("Май", "Весна"),
                6: ("Июнь", "Лето"),
                7: ("Июль", "Лето"),
                8: ("Август", "Лето"),
                9: ("Сентябрь", "Осень"),
                10: ("Октябрь", "Осень"),
                11: ("Ноябрь", "Осень"),
                12: ("Декабрь", "Зима"),
}
month = int(input("Введите порядковый номер месяца: "))
# Через список
if month == 12:
    print("Время года: ", seasons_list[0])
else:
    print("Время года: ", seasons_list[month//3])
# Через словарь
season_dict = year_dict.get(month)
print("Месяц: ", season_dict[0], "\nВремя года: ", season_dict[1])
